#ВАРИАНТ 25
# даны числа х,у. проверить истинность высказывания: "Точка с координатами (х,у) лежит во второй координатной четверти."
try:
    # ввод координат х,у
    x = float(input("Введите значение x: "))
    y = float(input("Введите значение y: "))
    # условие для второй координатной четверти (проверка являются ли координаты истинными для 2 четверти)
    if x < 0 and y > 0:
        print("Точка находится во второй четверти")
    else:
        print("Точка не находится во второй четверти")
except ValueError:
    #ошибка при вводе
    print("Ошибка, нужно ввести число")
