#ВАРИАНТ 25
#даны коордигаты поля шахматной доски x, y (целые числа, лежащие в диапазоне 1-8). учитывая, что левое нижнее поле доски
#(1,1) является черным, проверить истинность высказывания: "Днное поле является белым".
try:
    # ввод координат х, у
    x = float(input("Введите значение x: "))
    y = float(input("Введите значение y: "))

    if (x + y) % 2 == 0:
        print("Данное поле является черным")
    else:
        print("Данное поле является белым")
except ValueError:
    print("Ошибка, введите число")