#ВАРИАНТ 25
# даны числа х,у. проверить истинность высказывания: "Точка с координатами (х,у) лежит во второй координатной четверти."
x = float(input("Введите значение x: "))
y = float(input("Введите значение y: "))

while type(x) != int:
    try:
        x = int(x)
    except ValueError:
        print("Неправильно ввели!")
        x = input("Введите значение х:")
while type (y) != int:
    try:
        y = int(y)
    except ValueError:
        print("Неправильно ввели!")
        y = input("Введите значение у:")
    # условие для второй координатной четверти (проверка являются ли координаты истинными для 2 четверти)
if x < 0 and y > 0:
    print("Точка находится во второй четверти")
else:
    print("Точка не находится во второй четверти")
