#ВАРИАНТ 25
#даны коордигаты поля шахматной доски x, y (целые числа, лежащие в диапазоне 1-8). учитывая, что левое нижнее поле доски
#(1,1) является черным, проверить истинность высказывания: "Данное поле является белым".
x = float(input("Введите значение x: "))
y = float(input("Введите значение y: "))
while type(x) != int:
    try:
        x = int(x)
    except ValueError:
        print("Неправильно ввели!")
        x = input("Введите значение х:")
while type (y) != int:
    try:
        y = int(y)
    except ValueError:
        print("Неправильно ввели!")
        y = input("Введите значение у:")
if (x + y) % 2 == 0:
    print("Данное поле является черным")
else:
    print("Данное поле является белым")
