# даны два целых числа A и B ( A<B). вывести в порядке убывания все целые числа, расположенные между A и B
# ( включая сами числа а и б), а также количество этих чисел (использовать оператор цикла)
a = input("Введите целое число А: ")
b = input("Введите целое число B: ")

while type(a) != int:
    try:
        a = int(a)
    except ValueError:
        print("Неправильно ввели!")
        a = input("Введите целое чило А: ")
while type(b) != int:
    try:
        b = int(b)
    except ValueError:
        print("Неправильно ввели!")
        b = input("Введите целое число B: ")
N = 0
if b >= a:
    print(b)
    b -= 1
    N += 1
print("Количество чисел: ", N)